tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_DCDC.h
/*! @name CTRL0 - DCDC Control Register 0 */
/*! @{ */

#define DCDC_CTRL0_ENABLE_OK_CNT_MASK            (0x20U)
#define DCDC_CTRL0_ENABLE_OK_CNT_SHIFT           (5U)
/*! ENABLE_OK_CNT - Enable internal count for DCDC_OK timeout
 *  0b0..Wait DCDC_OK for ACK
 *  0b1..Enable internal count for DCDC_OK timeout
 */
#define DCDC_CTRL0_ENABLE_OK_CNT(x)              (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_ENABLE_OK_CNT_SHIFT)) & DCDC_CTRL0_ENABLE_OK_CNT_MASK)

#define DCDC_CTRL0_TRIM_HOLD_MASK                (0x40U)
#define DCDC_CTRL0_TRIM_HOLD_SHIFT               (6U)
/*! TRIM_HOLD - Hold trim input
 *  0b0..Sample trim value from FUSE or value from REG1[VBG_TRIM] depending on FUSE select bit.
 *  0b1..Use value from REG1[VBG_TRIM] as trim value.
 */
#define DCDC_CTRL0_TRIM_HOLD(x)                  (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_TRIM_HOLD_SHIFT)) & DCDC_CTRL0_TRIM_HOLD_MASK)

#define DCDC_CTRL0_IN_BROWNOUT_WARN_EN_MASK      (0x200U)
#define DCDC_CTRL0_IN_BROWNOUT_WARN_EN_SHIFT     (9U)
/*! IN_BROWNOUT_WARN_EN - IN_BROWNOUT_WARN_EN
 *  0b0..Disable IN_BROWNOUT_WARN int flag bit output to CORE as an interrupt resource.
 *  0b1..Enable IN_BROWNOUT_WARN int flag bit output to CORE as an interrupt resource.
 */
#define DCDC_CTRL0_IN_BROWNOUT_WARN_EN(x)        (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_IN_BROWNOUT_WARN_EN_SHIFT)) & DCDC_CTRL0_IN_BROWNOUT_WARN_EN_MASK)

#define DCDC_CTRL0_DEBUG_BITS_MASK               (0x7FF80000U)
#define DCDC_CTRL0_DEBUG_BITS_SHIFT              (19U)
#define DCDC_CTRL0_DEBUG_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_DEBUG_BITS_SHIFT)) & DCDC_CTRL0_DEBUG_BITS_MASK)

#define DCDC_CTRL0_TRG_GPC_EN_MASK               (0x80000000U)
#define DCDC_CTRL0_TRG_GPC_EN_SHIFT              (31U)
/*! TRG_GPC_EN - TRG_GPC_EN: used to enable TRG_GPC_* value or not.
 *  0b0..No matter there is GPC stby request or not, value in TRG_SW_* register will always be used as DCDC analog target value.
 *  0b1..When there is a GPC stby request, value in TRG_GPC_* register will be used as DCDC analog target value instead of TRG_SW_*'s
 */
#define DCDC_CTRL0_TRG_GPC_EN(x)                 (((uint32_t)(((uint32_t)(x)) << DCDC_CTRL0_TRG_GPC_EN_SHIFT)) & DCDC_CTRL0_TRG_GPC_EN_MASK)
/*! @} */

/*! @name OK_CNT - OK CNT */
/*! @{ */

#define DCDC_OK_CNT_OK_COUNT_MASK                (0xFFFFFFFFU)
#define DCDC_OK_CNT_OK_COUNT_SHIFT               (0U)
/*! OK_COUNT - OK_COUNT */
#define DCDC_OK_CNT_OK_COUNT(x)                  (((uint32_t)(((uint32_t)(x)) << DCDC_OK_CNT_OK_COUNT_SHIFT)) & DCDC_OK_CNT_OK_COUNT_MASK)
/*! @} */

/*! @name CURRENT_TRG - CURRENT TARGET VALUE for DCDC ANALOG */
/*! @{ */

#define DCDC_CURRENT_TRG_VDD1P0CTRL_TRG_MASK     (0x1FU)
#define DCDC_CURRENT_TRG_VDD1P0CTRL_TRG_SHIFT    (0U)
#define DCDC_CURRENT_TRG_VDD1P0CTRL_TRG(x)       (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_VDD1P0CTRL_TRG_SHIFT)) & DCDC_CURRENT_TRG_VDD1P0CTRL_TRG_MASK)

#define DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_MASK     (0x1F00U)
#define DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_SHIFT    (8U)
#define DCDC_CURRENT_TRG_VDD1P8CTRL_TRG(x)       (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_SHIFT)) & DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_MASK)

#define DCDC_CURRENT_TRG_DCDC_UPDATING_MASK      (0x8000U)
#define DCDC_CURRENT_TRG_DCDC_UPDATING_SHIFT     (15U)
/*! DCDC_UPDATING
 *  0b0..Last DCDC change has been done. New value can be written to TRG register to trigger a new change of DCDC voltage.
 *  0b1..Last DCDC change is still not done. New value should not be written to TRG register to trigger a new change of DCDC voltage.
 */
#define DCDC_CURRENT_TRG_DCDC_UPDATING(x)        (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_DCDC_UPDATING_SHIFT)) & DCDC_CURRENT_TRG_DCDC_UPDATING_MASK)

#define DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_MASK  (0x1F0000U)
#define DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_SHIFT (16U)
#define DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG(x)    (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_CURRENT_TRG_LP_EN_1P0_MASK          (0x80000000U)
#define DCDC_CURRENT_TRG_LP_EN_1P0_SHIFT         (31U)
/*! LP_EN_1P0 - Low-Power Enable. This value comes from the smaller one between TRG_SW_0 and TRG_SW_1.
 *  0b0..DCDC works in run mode. Its output voltage is controlled by VDD1P0CTRL_TRG.
 *  0b1..DCDC works in low power mode.
 */
#define DCDC_CURRENT_TRG_LP_EN_1P0(x)            (((uint32_t)(((uint32_t)(x)) << DCDC_CURRENT_TRG_LP_EN_1P0_SHIFT)) & DCDC_CURRENT_TRG_LP_EN_1P0_MASK)
/*! @} */

/*! @name FILTER_CNT - FILTER CNT */
/*! @{ */

#define DCDC_FILTER_CNT_FILTER_CNT_CFG_MASK      (0xFFFFFFFFU)
#define DCDC_FILTER_CNT_FILTER_CNT_CFG_SHIFT     (0U)
/*! FILTER_CNT_CFG - FILTER_CNT_CFG */
#define DCDC_FILTER_CNT_FILTER_CNT_CFG(x)        (((uint32_t)(((uint32_t)(x)) << DCDC_FILTER_CNT_FILTER_CNT_CFG_SHIFT)) & DCDC_FILTER_CNT_FILTER_CNT_CFG_MASK)
/*! @} */

/*! @name TRG_0_AUTHEN - TRG_0 Authentication Control */
/*! @{ */

#define DCDC_TRG_0_AUTHEN_TZ_USER_MASK           (0x100U)
#define DCDC_TRG_0_AUTHEN_TZ_USER_SHIFT          (8U)
/*! TZ_USER - Allow user mode write
 *  0b0..TRG_0 registers can only be written in privilege mode.
 *  0b1..TRG_0 registers can be written either in privilege mode or user mode.
 */
#define DCDC_TRG_0_AUTHEN_TZ_USER(x)             (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_TZ_USER_SHIFT)) & DCDC_TRG_0_AUTHEN_TZ_USER_MASK)

#define DCDC_TRG_0_AUTHEN_TZ_NS_MASK             (0x200U)
#define DCDC_TRG_0_AUTHEN_TZ_NS_SHIFT            (9U)
/*! TZ_NS - Allow non-secure mode access
 *  0b0..TRG_0 registers can only be written in secure mode.
 *  0b1..TRG_0 registers can be written either in secure mode or non-secure mode.
 */
#define DCDC_TRG_0_AUTHEN_TZ_NS(x)               (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_TZ_NS_SHIFT)) & DCDC_TRG_0_AUTHEN_TZ_NS_MASK)

#define DCDC_TRG_0_AUTHEN_LOCK_TZ_MASK           (0x800U)
#define DCDC_TRG_0_AUTHEN_LOCK_TZ_SHIFT          (11U)
/*! LOCK_TZ - Lock TZ_NS and TZ_USER
 *  0b0..TZ_NS and TZ_USER value can be changed.
 *  0b1..LOCK_TZ, TZ_NS and TZ_USER value cannot be changed.
 */
#define DCDC_TRG_0_AUTHEN_LOCK_TZ(x)             (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_0_AUTHEN_LOCK_TZ_SHIFT)) & DCDC_TRG_0_AUTHEN_LOCK_TZ_MASK)

