tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_DCDC.h
#define DCDC_TRG_SW_1_VDD1P8CTRL_TRG_MASK        (0x1F00U)
#define DCDC_TRG_SW_1_VDD1P8CTRL_TRG_SHIFT       (8U)
#define DCDC_TRG_SW_1_VDD1P8CTRL_TRG(x)          (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_1_VDD1P8CTRL_TRG_SHIFT)) & DCDC_TRG_SW_1_VDD1P8CTRL_TRG_MASK)

#define DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_MASK     (0x1F0000U)
#define DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_SHIFT    (16U)
#define DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG(x)       (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_TRG_SW_1_LP_EN_1P0_MASK             (0x80000000U)
#define DCDC_TRG_SW_1_LP_EN_1P0_SHIFT            (31U)
/*! LP_EN_1P0 - Low-Power Enable */
#define DCDC_TRG_SW_1_LP_EN_1P0(x)               (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_SW_1_LP_EN_1P0_SHIFT)) & DCDC_TRG_SW_1_LP_EN_1P0_MASK)
/*! @} */

/*! @name TRG_GPC_1 - Target GPC Control for CORE 1 */
/*! @{ */

#define DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_MASK       (0x1FU)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_SHIFT      (0U)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_TRG(x)         (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_SHIFT)) & DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_MASK)

#define DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_MASK       (0x1F00U)
#define DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_SHIFT      (8U)
#define DCDC_TRG_GPC_1_VDD1P8CTRL_TRG(x)         (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_SHIFT)) & DCDC_TRG_GPC_1_VDD1P8CTRL_TRG_MASK)

#define DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_MASK    (0x1F0000U)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_SHIFT   (16U)
#define DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG(x)      (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_SHIFT)) & DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_MASK)

#define DCDC_TRG_GPC_1_LP_EN_1P0_MASK            (0x80000000U)
#define DCDC_TRG_GPC_1_LP_EN_1P0_SHIFT           (31U)
/*! LP_EN_1P0 - Low-Power Enable */
#define DCDC_TRG_GPC_1_LP_EN_1P0(x)              (((uint32_t)(((uint32_t)(x)) << DCDC_TRG_GPC_1_LP_EN_1P0_SHIFT)) & DCDC_TRG_GPC_1_LP_EN_1P0_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group DCDC_Register_Masks */


/*!
 * @}
 */ /* end of group DCDC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_DCDC_H_ */

